MissouriMRDT/BMS_Software/libraries/RoveBoard/tm4c1294ncpdt_API/RovePwmRead/RovePwmRead_TivaTM4C1294NCPDT.cpp
#include "RovePwmRead_TivaTM4C1294NCPDT.h"
#include "supportingUtilities/Debug.h"
#include "../RovePinMap_TivaTM4C1294NCPDT.h"
#include "../tivaware/inc/hw_ints.h" //hardware constants for interrupts
#include "../tivaware/inc/hw_memmap.h" //hardware memory for things such as peripheral device base address
#include "../tivaware/inc/hw_types.h" //hardware macros such as HWREG which is a macro used to access registers
#include "../tivaware/inc/hw_timer.h" //hardware constants for timers
#include "../tivaware/driverlib/gpio.h"
#include "../tivaware/driverlib/interrupt.h"
#include "../tivaware/driverlib/pin_map.h" //hardware memory map for things such as alternate pin mode constants, such as timer1 module's base address. No idea why it's not in inc/
#include "../tivaware/driverlib/rom.h"
#include "../tivaware/driverlib/sysctl.h"
#include "../tivaware/driverlib/timer.h"

/* Algorithm description:
   How this works is that a timer module is set up so that its 
   timer A (each module actually has 2 mini timers inside, A and  
   B) will be put into edge-time-capture mode, and timer B gets 
   put into periodic count up mode. Both timers are loaded with 
   the same timeout value so they'll loop at about the same 
   time. 

   What edge-capture-time mode does is it makes the timer 
   constantly run in the background, and when it detects 
   either a rising edge pulse or a falling edge pulse (can be 
   configured for one or another or both, here both) on 
   its associated GPIO pin it triggers an interrupt for the
   event, and records into its value register the time it was
   at when it recieved the pulse. So when it captures the time
   of when the pulse went high and then when the pulse went low,
   you can use the two values to calculate the pulse's on period
   and same for the off period for when the pulse goes low. 
   The one thing to beware of is that the timer eventually loops
   in the background, so you have to watch for when that happens
   as it will make the captured time value be incorrect. 
   So long as the pulse's period isn't longer than how long it
   takes the timer to timeout then you can simply look for this
   condition by noting that the captured value is smaller than
   the previously captured value, and correct it mathematically.
   If the pulse period is longer than the timer timeout period, 
   then you can no longer tell based on the 'is it smaller than
   previous' technique, restricting the PWM reader library 
   to only being able to read PWM signals with periods equal to 
   or smaller than the maximum timer period, which is 2^24-1 in 
   clock ticks or a pulse of 1.04 seconds with the 16Mhz clock. 

   While this works for nominal readings, we have to be wary of 
   non nominal conditions such as 0% duty cycle and 100% duty 
   cycle, where no edge ever occurs and thus the capture ISR
   never triggers and the readings look incorrect from the 
   outside. To take care of this, we set up Timer B to trigger
   an interrupt at the same rate Timer A times out, IE the 
   expected amount of time it takes at least one transmission
   to happen. Timer A will set a flag for 'I recieved a pulse'
   whenever it does, and Timer B's interrupt will check this 
   flag when it triggers to make sure transmissions occured. 
   If it did, then it simply resets the flag and rests for 
   another presumed PWM reading cycle. If it did not, then
   it checks to see if our last known reading was high or low.
   If it was high then it means we're idling at high voltage
   on the input pin, 100% duty cycle. In that case it resets
   the data variables for that pwm line so that they will 
   be ready again for the next reading, and sets the duty 
   variable for that pwm line to 100 so the user can know.
   We encounter a problem here when the duty goes back to 
   anything else however; going from 100% to any other
   duty cycle renders the first non 100% transmission 
   unreadable, as we can't tell when the on-pulse actually
   started as compared to the rest of the 100% pulses. So
   it tells the capture ISR to skip its calculations for 
   the next pulse, afterwords it resumes operation as normal.
   If the last captured edge was low, meanwhile, then it means
   we are at 0% cycle. It then simply resets the data back into
   its initial state, sets the duty variable to 0 and that's it.

   Working together, the two interrupts are able to read PWM
   signals with little data being lost. 
   
   The library is built to do this for all 6 timers that can be
   used if need be. 

   I also made a bunch of static const lookup tables for the 
   hardware references, just so the user of this library could 
   have very general inputs without having to worry about 
   setting the hardware up

*/

const uint8_t Internal_PortARef = 0;
const uint8_t Internal_PortBRef = 1;
const uint8_t Internal_PortDRef = 2;
const uint8_t Internal_PortLRef = 3;
const uint8_t Internal_PortMRef = 4;

const float SysClockFreq = 16000000; //frequency of the internal precision clock, which the timers use

//Table for the pin number macros -- the tiva hardware drivers
//don't take 0-7 for pins but these special constants. 
//Input: desired pin constant 0-7
//Output: pin constant that can actually be passed to tiva's 
//hardware drivers for pins 0-7
static const uint8_t pinMacroTable[8] = {GPIO_PIN_0 , GPIO_PIN_1 , GPIO_PIN_2 , GPIO_PIN_3 , GPIO_PIN_4 , GPIO_PIN_5 , GPIO_PIN_6 , GPIO_PIN_7 };

//table containing base addresses of the GPIO port's peripheral enable constants.
//input: reference number for gpio port, based on the 'PortXRef' constants
//output: constant used with the 'SysCtlPeriphEnable' function to turn on this gpio port
static const uint32_t pinPortPeriphTable[5] = {SYSCTL_PERIPH_GPIOA, SYSCTL_PERIPH_GPIOB, SYSCTL_PERIPH_GPIOD, SYSCTL_PERIPH_GPIOL, SYSCTL_PERIPH_GPIOM};

//table containing the base addresses of the GPIO ports used in this program
//input: 0-4, representing port a, b, d, l, and m
//output: base hardware address of the port
static const uint32_t pinPortBaseTable[5] = {GPIO_PORTA_BASE, GPIO_PORTB_BASE, GPIO_PORTD_BASE, GPIO_PORTL_BASE, GPIO_PORTM_BASE};

