MissouriMRDT/BMS_Software/libraries/RoveBoard/tm4c1294ncpdt_API/RovePwmRead/RovePwmRead_TivaTM4C1294NCPDT.cpp
//Table for special timer pin names. Use this table to get 
//the constant needed for the 'GPIOPinConfigure' function
//input: GPIO port being used (A,B,D,L,M, as 0-4)
// and pin number being used, 0-7
static const uint32_t timerPinConfigTable[5][8] = 
{
  {GPIO_PA0_T0CCP0, GPIO_PA1_T0CCP1, GPIO_PA2_T1CCP0, GPIO_PA3_T1CCP1, GPIO_PA4_T2CCP0, GPIO_PA5_T2CCP1, GPIO_PA6_T3CCP0, GPIO_PA7_T3CCP1}, //A0-A7
  {GPIO_PB0_T4CCP0, GPIO_PB1_T4CCP1, GPIO_PB2_T5CCP0, GPIO_PB3_T5CCP1, 0, 0, 0, 0}, //B0-B7
  {GPIO_PD0_T0CCP0, GPIO_PD1_T0CCP1, GPIO_PD2_T1CCP0, GPIO_PD3_T1CCP1, GPIO_PD4_T3CCP0, GPIO_PD5_T3CCP1, GPIO_PD6_T4CCP0, GPIO_PD7_T4CCP1}, //D0-D7
  {0, 0, 0, 0, GPIO_PL4_T0CCP0, GPIO_PL5_T0CCP1, GPIO_PL6_T1CCP0, GPIO_PL7_T1CCP1}, //L0-L7
  {GPIO_PM0_T2CCP0, GPIO_PM1_T2CCP1, GPIO_PM2_T3CCP0, GPIO_PM3_T3CCP1, GPIO_PM4_T4CCP0, GPIO_PM5_T4CCP1, GPIO_PM6_T5CCP0, GPIO_PM7_T5CCP1}  //M0-M7
};

//table for referencing which timer number is related to which gpio port and pin
//input: [0-4 for a,b,d,l, and m] [0-7 for pins 0-7]
//output: 1 for timer 1, 2 for timer 2, etc. 8 if nothing on that port-pin combo
static const uint8_t PinToTimerNumberTable_None = 8;
static const uint8_t pinToTimerNumberTable[5][8] = 
{
  {0, 0, 1, 1, 2, 2, 3, 3}, //A0-A7
  {4, 4, 5, 5, PinToTimerNumberTable_None, PinToTimerNumberTable_None, PinToTimerNumberTable_None, PinToTimerNumberTable_None}, //B0-B7
  {0, 0, 1, 1, 3, 3, 4, 4}, //D0-D7
  {PinToTimerNumberTable_None, PinToTimerNumberTable_None, PinToTimerNumberTable_None, PinToTimerNumberTable_None, 0, 0, 1, 1}, //L0-L7
  {2, 2, 3, 3, 4, 4, 5, 5}  //M0-M7
};

//Table for referencing energia-style pin constant mapping to 
//what port the pin number represents. Refer to this link to see 
//energia's pin constant mapping for the TM4C1294: https://github.com/energia/Energia/blob/master/hardware/lm4f/variants/launchpad_129/pins_energia.h
//input: pin 0-96
//output: letter for the related pin port, like 'P' for port P. 0 (null in ascii) if not a usable pin
static const char pinMapToPort[]       = {
    0,      		// dummy 
    0,      		// 01 - 3.3v       X8_01
    'E',            // 02 - PE_4       X8_03
    'C',            // 03 - PC_4       X8_05
    'C',            // 04 - PC_5       X8_07
    'C',            // 05 - PC_6       X8_09
    'E',            // 06 - PE_5       X8_11
    'D',            // 07 - PD_3       X8_13
    'C',            // 08 - PC_7       X8_15
    'B',            // 09 - PB_2       X8_17
    'B',            // 10 - PB_3       X8_19
    'P',            // 11 - PP_2       X9_20
    'N',            // 12 - PN_3       X9_18
    'N',            // 13 - PN_2       X9_16
    'D',            // 14 - PD_0       X9_14
    'D',            // 15 - PD_1       X9_12
    0,      		// 16 - RST        X9_10
    'H',            // 17 - PH_3       X9_08
    'H',            // 18 - PH_2       X9_06
    'M',            // 19 - PM_3       X9_04
    0,      		// 20 - GND        X9_02
    0,     		 	// 21 - 5v         X8_02
    0,      		// 22 - GND        X8_04
    'E',            // 23 - PE_0       X8_06
    'E',            // 24 - PE_1       X8_08
    'E',            // 25 - PE_2       X8_10
    'E',            // 26 - PE_3       X8_12
    'D',            // 27 - PD_7       X8_14
    'A',            // 28 - PA_6       X8_16
    'M',            // 29 - PM_4       X8_18
    'M',            // 30 - PM_5       X8_20
    'L',            // 31 - PL_3       X9_19
    'L',            // 32 - PL_2       X9_17
    'L',            // 33 - PL_1       X9_15
    'L',            // 34 - PL_0       X9_13
    'L',            // 35 - PL_5       X9_11
    'L',            // 36 - PL_4       X9_09
    'G',            // 37 - PG_0       X9_07
    'F',            // 38 - PF_3       X9_05
    'F',            // 39 - PF_2       X9_03
    'F',            // 40 - PF_1       X9_01
    0,     			// 41 - 3.3v       X6_01
    'D',            // 42 - PD_2       X6_03
    'P',            // 43 - PP_0       X6_05
    'P',            // 44 - PP_1       X6_07
    'D',            // 45 - PD_4       X6_09
    'D',            // 46 - PD_5       X6_11
    'Q',            // 47 - PQ_0       X6_13
    'P',            // 48 - PP_4       X6_15
    'N',            // 49 - PN_5       X6_17
    'N',            // 50 - PN_4       X6_19
    'M',            // 51 - PM_6       X7_20
    'Q',            // 52 - PQ_1       X7_18
    'P',            // 53 - PP_3       X7_16
    'Q',            // 54 - PQ_3       X7_14
    'Q',            // 55 - PQ_2       X7_12
    0,     			// 56 - RESET      X7_10
    'A',            // 57 - PA_7       X7_08
    'P',            // 58 - PP_5       X7_06
    'M',            // 59 - PM_7       X7_04
    0,      		// 6Z - GND        X7_02
    0,      		// 61 - 5v         X6_02
    0,      		// 62 - GND        X6_04
    'B',            // 63 - PB_4       X6_06
    'B',            // 64 - PB_5       X6_08
    'K',            // 65 - PK_0       X6_10
    'K',            // 66 - PK_1       X6_12
    'K',            // 67 - PK_2       X6_14
    'K',            // 68 - PK_3       X6_16
    'A',            // 69 - PA_4       X6_18
    'A',            // 70 - PA_5       X6_20
    'K',            // 71 - PK_7       X7_19
    'K',            // 72 - PK_6       X7_17
    'H',            // 73 - PH_1       X7_15
    'H',            // 74 - PH_0       X7_13
    'M',            // 75 - PM_2       X7_11
    'M',            // 76 - PM_1       X7_09
    'M',            // 77 - PM_0       X7_07
    'K',            // 78 - PK_5       X7_05
    'K',            // 79 - PK_4       X7_03
    'G',            // 80 - PG_1       X7_01
    'N',            // 81 - PN_1       LED1
    'N',            // 82 - PN_0       LED2
    'F',            // 83 - PF_4       LED3
    'F',            // 84 - PF_0       LED4
    'J',            // 85 - PJ_0       USR_SW1
    'J',            // 86 - PJ_1       USR_SW2
    'D',            // 87 - PD_6       AIN5
    'A',            // 88 - PA_0       JP4
    'A',            // 89 - PA_1       JP5
    'A',            // 90 - PA_2       X11_06
    'A',            // 91 - PA_3       X11_08
    'L',            // 92 - PL_6       unrouted
    'L',            // 93 - PL_7       unrouted
    'B',            // 94 - PB_0       X11_58
    'B',            // 95 - PB_1       unrouted
};
 
//Table for referencing energia-style pin constant mapping to 
//what pin number (0-7) the pin map number represents. Refer to this link to see 
//energia's pin constant mapping for the TM4C1294: https://github.com/energia/Energia/blob/master/hardware/lm4f/variants/launchpad_129/pins_energia.h
//input: pins mapped 0-96
//output: 0-7, for pin 0,1,2,3...7. 255 if not a usable pin
static const uint8_t pinMapToPinNum[]   = {
    255,    	  // dummy 
    255,    	  // 01 - 3.3v       X8_01
    (4),          // 02 - PE_4       X8_03
    (4),          // 03 - PC_4       X8_05
    (5),          // 04 - PC_5       X8_07
    (6),          // 05 - PC_6       X8_09
    (5),          // 06 - PE_5       X8_11
    (3),          // 07 - PD_3       X8_13
    (7),          // 08 - PC_7       X8_15
    (2),          // 09 - PB_2       X8_17
    (3),          // 10 - PB_3       X8_19
    (2),          // 11 - PP_2       X9_20
    (3),          // 12 - PN_3       X9_18
    (2),          // 13 - PN_2       X9_16
    (0),          // 14 - PD_0       X9_14
    (1),          // 15 - PD_1       X9_12
    255,    	  // 16 - RST        X9_10
    (3),          // 17 - PH_3       X9_08
    (2),          // 18 - PH_2       X9_06
    (3),          // 19 - PM_3       X9_04
    255,      	  // 20 - GND        X9_02
    255,      	  // 21 - 5v         X8_02
    255,    	  // 22 - GND        X8_04
    (0),          // 23 - PE_0       X8_06
    (1),          // 24 - PE_1       X8_08
    (2),          // 25 - PE_2       X8_10
    (3),          // 26 - PE_3       X8_12
    (7),          // 27 - PD_7       X8_14
    (6),          // 28 - PA_6       X8_16
    (4),          // 29 - PM_4       X8_18
    (5),          // 30 - PM_5       X8_20
    (3),          // 31 - PL_3       X9_19
    (2),          // 32 - PL_2       X9_17
    (1),          // 33 - PL_1       X9_15
    (0),          // 34 - PL_0       X9_13
    (5),          // 35 - PL_5       X9_11
    (4),          // 36 - PL_4       X9_09
    (0),          // 37 - PG_0       X9_07
    (3),          // 38 - PF_3       X9_05
    (2),          // 39 - PF_2       X9_03
    (1),          // 40 - PF_1       X9_01
    255,      	  // 41 - 3.3v       X6_01
    (2),          // 42 - PD_2       X6_03
    (0),          // 43 - PP_0       X6_05
    (1),          // 44 - PP_1       X6_07
    (4),          // 45 - PD_4       X6_09
    (5),          // 46 - PD_5       X6_11
    (0),          // 47 - PQ_0       X6_13
    (4),          // 48 - PP_4       X6_15
    (5),          // 49 - PN_5       X6_17
    (4),          // 50 - PN_4       X6_19
    (6),          // 51 - PM_6       X7_20
    (1),          // 52 - PQ_1       X7_18
    (3),          // 53 - PP_3       X7_16
    (3),          // 54 - PQ_3       X7_14
    (2),          // 55 - PQ_2       X7_12
    255,      	  // 56 - RESET      X7_10
    (7),          // 57 - PA_7       X7_08
    (5),          // 58 - PP_5       X7_06
    (7),          // 59 - PM_7       X7_04
    255,      	  // 60 - GND        X7_02
    255,      	  // 61 - 5v         X6_02
    255,      	  // 62 - GND        X6_04
    (4),          // 63 - PB_4       X6_06
    (5),          // 64 - PB_5       X6_08
    (0),          // 65 - PK_0       X6_10
    (1),          // 66 - PK_1       X6_12
    (2),          // 67 - PK_2       X6_14
    (3),          // 68 - PK_3       X6_16
    (4),          // 69 - PA_4       X6_18
    (5),          // 70 - PA_5       X6_20
    (7),          // 71 - PK_7       X7_19
    (6),          // 72 - PK_6       X7_17
    (1),          // 73 - PH_1       X7_15
    (0),          // 74 - PH_0       X7_13
    (2),          // 75 - PM_2       X7_11
    (1),          // 76 - PM_1       X7_09
    (0),          // 77 - PM_0       X7_07
    (5),          // 78 - PK_5       X7_05
    (4),          // 79 - PK_4       X7_03
    (1),          // 80 - PG_1       X7_01
    (1),          // 81 - PN_1       LED1
    (0),          // 82 - PN_0       LED2
    (4),          // 83 - PF_4       LED3
    (0),          // 84 - PF_0       LED4
    (0),          // 85 - PJ_0       USR_SW1
    (1),          // 86 - PJ_1       USR_SW2
    (6),          // 87 - PD_6       AIN5
    (0),          // 88 - PA_0       JP4
    (1),          // 89 - PA_1       JP5
    (2),          // 90 - PA_2       X11_06
    (3),          // 91 - PA_3       X11_08
    (6),          // 92 - PL_6       unrouted
    (7),          // 93 - PL_7       unrouted
    (0),          // 94 - PB_0       X11_58
    (1),          // 95 - PB_1       unrouted
};

//table for referencing timer number to their hardware base addresses
//input: 0-5 for timer 0, 1, 2, 3, 4, 5
//output: base hardware address of the timer
static const uint32_t timerBaseTable[6] = {TIMER0_BASE, TIMER1_BASE, TIMER2_BASE, TIMER3_BASE, TIMER4_BASE, TIMER5_BASE};

//number of timers used in this program
static const int NumberOfTimersUsed = 6;

