MissouriMRDT/BMS_Software/libraries/RoveBoard/tm4c1294ncpdt_API/RovePwmRead/RovePwmRead_TivaTM4C1294NCPDT.cpp
//enum that keeps track of pin's last known reading state
typedef enum Pinstate {pulseH, pulseL} Pinstate;

//struct that holds all the data for the PWM line
typedef volatile struct
{
  uint32_t tOn;
  uint32_t tOff;
  int64_t tRise;
  int64_t tFall;
  uint8_t duty;
  uint32_t timerLoad;
  uint32_t portBase;
  uint8_t pinMacro;
  bool periodIncalculable;
  bool edgeRecieved;
  Pinstate pinState;
} timerData;

//event handlers
static void timeout0Handler();
static void edgeCapture0Handler();

static void timeout1Handler();
static void edgeCapture1Handler();

static void timeout2Handler();
static void edgeCapture2Handler();

static void timeout3Handler();
static void edgeCapture3Handler();

static void timeout4Handler();
static void edgeCapture4Handler();

static void timeout5Handler();
static void edgeCapture5Handler();

static void timeoutGenHandler(timerData * data);
static void edgeCaptureGenHandler(timerData * data, uint32_t timerBase);

//hardware initializing functions and variable init'ing funcs
static bool initGPIO(uint8_t portLetter, uint8_t pinNum, uint8_t * pinInitState, uint32_t * port_base, uint8_t * pin_macro);
static bool initTimer(uint32_t frequency, uint8_t timerNum);
static void initData(uint8_t timerNum, uint32_t timerLoad, uint8_t pinInitState, uint32_t port_base, uint8_t pin_macro);

//pass in a gpioport letter and number such as 'a' and '2', and it returns
//which timer is associated from it, 1 - 5. Returns 0 if no timer uses that pin port and pin number
static uint8_t getTimerNumber(char gpioPortLetter, uint8_t pinNumber);

//get a reference number for a certain port that can be passed into the various tables 
//with the number representing the port for those tables. Returns -1 if improper input
static int getPortRefNum(char portLetter);

//returns whether or not the timer module can use the mapped pin
static bool moduleUsesCorrectPins(uint8_t timerModule, uint8_t mappedPin);

//each timer and through them PWM line has a data struct 
//for their usage
static timerData timer0Data, timer1Data, timer2Data, timer3Data, timer4Data, timer5Data;

//the edge-not-recieved timeout check should last longer than any transmission period, so that when we say that the edge wasn't received,
//we know it's not just the timeout moving too quickly for the pwm transmission. So, we have the timeout isr trigger a certain number 
//of times before it actually checks, with the base timeout load being the same as the timer doing the edge-time counting
static volatile uint8_t timeoutCounter = 0;

//edge-not-recieved timeout check should do its checking after this many timeouts (start with 1, not 0)
//static const uint8_t TimeoutCounterLimit = 1; didn't wind up needing it

//interrupt handler for timer 0's timeout event.
static void timeout0Handler()
{
  TimerIntClear(TIMER0_BASE, TIMER_TIMB_TIMEOUT); // clear the timer interrupt
  timeoutGenHandler(&timer0Data);
}

//interrupt handelr for timer 0's edge capture event.
static void edgeCapture0Handler()
{
  TimerIntClear(TIMER0_BASE, TIMER_CAPA_EVENT); // clear the timer interrupt
  edgeCaptureGenHandler(&timer0Data, TIMER0_BASE);
}

//interrupt handler for timer 1's timeout event. 
static void timeout1Handler()
{
  TimerIntClear(TIMER1_BASE, TIMER_TIMB_TIMEOUT); // clear the timer interrupt
  timeoutGenHandler(&timer1Data);
}

//interrupt handler for timer 1's edge capture event. 
static void edgeCapture1Handler()
{
  TimerIntClear(TIMER1_BASE, TIMER_CAPA_EVENT); // clear the timer interrupt
  edgeCaptureGenHandler(&timer1Data, TIMER1_BASE);
}

//interrupt handler for timer 2's timeout event. 

static void timeout2Handler()
{
  TimerIntClear(TIMER2_BASE, TIMER_TIMB_TIMEOUT); // clear the timer interrupt
  timeoutGenHandler(&timer2Data);
}

//interrupt handler for timer 2's edge capture event. 
static void edgeCapture2Handler()
{
  TimerIntClear(TIMER2_BASE, TIMER_CAPA_EVENT); // clear the timer interrupt
  edgeCaptureGenHandler(&timer2Data, TIMER2_BASE);
}

//interrupt handler for timer 3's timeout event. 
static void timeout3Handler()
{
  TimerIntClear(TIMER3_BASE, TIMER_TIMB_TIMEOUT); // clear the timer interrupt
  timeoutGenHandler(&timer3Data);
}

//interrupt handler for timer 3's edge capture event. 
static void edgeCapture3Handler()
{
  TimerIntClear(TIMER3_BASE, TIMER_CAPA_EVENT); // clear the timer interrupt
  edgeCaptureGenHandler(&timer3Data, TIMER3_BASE);
}

//interrupt handler for timer 4's timeout event. 
static void timeout4Handler()
{
  TimerIntClear(TIMER4_BASE, TIMER_TIMB_TIMEOUT); // clear the timer interrupt
  timeoutGenHandler(&timer4Data);
}

//interrupt handler for timer 4's edge capture event. 
static void edgeCapture4Handler()
{
  TimerIntClear(TIMER4_BASE, TIMER_CAPA_EVENT); // clear the timer interrupt
  edgeCaptureGenHandler(&timer4Data, TIMER4_BASE);
}

//interrupt handler for timer 5's timeout event. 
static void timeout5Handler()
{
  TimerIntClear(TIMER5_BASE, TIMER_TIMB_TIMEOUT); // clear the timer interrupt
  timeoutGenHandler(&timer5Data);
}

//interrupt handler for timer 5's edge capture event. 
static void edgeCapture5Handler()
{
  TimerIntClear(TIMER5_BASE, TIMER_CAPA_EVENT); // clear the timer interrupt
  edgeCaptureGenHandler(&timer5Data, TIMER5_BASE);
}

//procedure for handling a timeout event. 
//Checks to see if the passed PWM line has 
//changed states since the last checkup. 
//If it hasn't, it means either the line is idling low,
//or we're at 100% duty cycle.
//If it's the former, simply reset the data structure
//so it will be ready to begin anew the next time 
//a pulse is sent. 
//If it's the latter, then it's impossible to 
//know the period when the next pwm pulse is sent the first
//time, as the beginning of the on pulse merges with the 
//previous always-on pulses with no telling when the two 
//differ. Reset the data as well, but also hit the 
//'period incalculable' flag so the edge capture handler
//won't attempt to calculate anything for the first pulse it
//gets after dropping from 100% duty cycle. After that first 
//pulse clears, the period becomes readable again.
//If the line HAS seen a voltage change since we last checked,
//then no management is necessary and simply reset the 'pulse 
//recieved' flag for the next check cycle.
static void timeoutGenHandler(timerData * data)
{
  //It's possible the isr will trigger a few times before actually checking, depending on what the counter limit was programed to be. If it does, then it's a 
  //precaution to make sure we only actually check after any transmission should have already come if it wasn't at 0 or 100%.
  //that way, we know that if we haven't received an edge it's because the line is idling at 100% or 0% duty, and not just 
  //because the pwm line didn't have a chance to receive the next edge before we checked
  //if(timeoutCounter < TimeoutCounterLimit - 1)
  //{
    //timeoutCounter++; never wound up needing this
  //}
  //else
  //{
    timeoutCounter = 0;
    uint32_t portBase = data->portBase;
    uint8_t pinMacro = data->pinMacro;
    
    //if the edge received flag is false, it means the edge capture handler hasn't 
    //set it to true, which means we haven't received an edge since the last time
    //we checked. Since both clocks run at the same time, this means the voltage state
    //on the pwm line hasn't changed in at least twice the expected pwm period due to this isr waiting at least one timeout period
    //before performing its checks. So either the 
    //transmission has ceased and the line is idling low, or the line is idling high
    //or that is to say they are sending 100% duty cycle.
  
    if(data->edgeRecieved == false)
    {
      if((GPIOPinRead(portBase, pinMacro) & pinMacro) == 0) //Pin low. transmission ended/0% duty. Put data back into init state
      {
        //Serial.println("Resetting due to 0%");
        data->tRise = 0;
        data->tFall = 0;
        data->tOn = 0;
        data->tOff = 0;
        data->duty = 0;
        data->periodIncalculable = false;
  
