MissouriMRDT/BMS_Software/libraries/RoveBoard/tm4c1294ncpdt_API/RovePwmRead/RovePwmRead_TivaTM4C1294NCPDT.cpp
      }
  
      //100% duty. Put data back into init state, but note that it's impossible to calculate
      //period when it's a flat line. Set the 'can't calculate' flag, which will tell
      //the capture routine to not calculate duty for a cycle
      else
      {
        //Serial.println("Resetting due to 100%");
        data->tRise = 0;
        data->tFall = 0;
        data->tOn = 0;
        data->tOff = 0;
        data->duty = 100;
        data->periodIncalculable = true;
      }
    }
    else //edge occured so pwm transmission is happening as normal. Reset edge occured flag for next check
    {
      data->edgeRecieved = false;
    }
  //}//end else
}

//general interrupt handler for edge capture events. 
//Read the current time the captured edge was captured at,
//and use it to calculate either pulse On period or pulse Off
//period, depending on if it was a rising or falling edge 
//captured. Also set the pulse received flag so the 
//timeout interrupt knows we recieved something since the last
//time it checked. Calculate duty of the pulse if it was a 
//rising edge we recieved.
//Note that if the period is expected to be incalculable for
//any reason, the calculations are skipped for this one cycle
static void edgeCaptureGenHandler(timerData * data, uint32_t timerBase)
{
  uint16_t valueFirst16 = 0;
  uint8_t valueLast8 = 0;
  uint32_t portBase = data -> portBase;
  uint8_t pinMacro = data -> pinMacro;
  data->edgeRecieved = true;
  
  valueFirst16 = HWREG(timerBase + TIMER_O_TAR); //first 16 bits of timer snapshot in timer register
  valueLast8 = HWREG(timerBase + TIMER_O_TAPS);  //last 8 bits of timer snapshot in timer prescale snapshot register. This was NOT in the driverlib, before anyone whines

  //If pin is high, we recieved rising edge. Calculate time of the off period based on the 
  //newly captured time of the rise capture minus the time of the last
  //recorded fall capture, IE the time the line was low. 
  //Also since this is usually the end of the PWM period, calculate 
  //duty cycle at this step unless the period was incalculable
  if((GPIOPinRead(portBase, pinMacro) & pinMacro) > 0)
  {
    data->pinState = pulseH;
    data->tRise = (int64_t)((uint32_t)valueFirst16 + (uint32_t)((uint32_t)valueLast8 << 16)); //put the two together into one 24 bit value

    //if the newly read value is less than the last recorded val, timer reset in between readings. For calculation of tOff, set tFall down the timer period
    if(data->tRise <  data->tFall)
    {
      data->tFall -= (int64_t)data->timerLoad;
    }

    data->tOff = (uint32_t)(data->tRise - data->tFall);

    if(data->periodIncalculable == false) //if period was incalculable for some edge-case condition, then skip doing the duty math this cycle around
    {
      data->duty = (float)((float)data->tOn/(float)(data->tOn + data->tOff)) * 100;
    }
    else
    {
      //if the period is noted to be incalculable, it was probably due to going from 100% to something else, and now that we have readable pulses again
      //the period should be calculable for the next reading
      data->periodIncalculable = false;
    }
  }//end if


  //if the last capture was a rising edge, then this is a falling edge capture. 
  //Timer value is tFall, calculate tOn with time of newest value of falling edge
  //minus value of last rising edge.
  else
  {
    data->pinState = pulseL;
          
    if(data->periodIncalculable == false) //if period is noted to be incalculable this cycle, skip it
    { 
      data->tFall = (int64_t)((uint32_t)valueFirst16 + (uint32_t)((uint32_t)valueLast8 << 16));
      
      if(data->tFall < data->tRise)
      {
        data->tRise -= (int64_t)data->timerLoad;
      }

      data->tOn = (uint32_t)(data->tFall - data->tRise);
    }
  }
}
//Wrapper for internal initPwmRead, added layer to let the user pass
//an energia pin map value. Returns false if user input a parameter incorrectly
RovePwmRead_Handle initPwmRead(uint8_t readingModule, uint8_t mappedPin)
{	
	if(mappedPin > 95) //only 95 mapped pins
	{
		debugFault("initPwmRead: mapped pin too large");
	}
	
  uint32_t timerLoad = 16777215; //2^24 - 1, max load
  uint32_t portBase;
  uint8_t pinMacro;
  uint8_t timerNumber;
  uint8_t pinInitialState;

	char gpioPort = pinMapToPort[mappedPin];
	if(gpioPort == 0) //0 is error value for this table
	{
	  debugFault("initPwmRead: mappedPin error with getting gpio port");
	}
	
	uint8_t pinNumber = pinMapToPinNum[mappedPin];
	if(pinNumber == 255) //255 is error value for this table
	{
    debugFault("initPwmRead: mappedPin error with getting hardware pin number");
	}
	
	if(!moduleUsesCorrectPins(readingModule, mappedPin))
	{
    debugFault("initPwmRead: pwm read module doesn't use that pin");
	}

	timerNumber = getTimerNumber(gpioPort, pinNumber);
  initGPIO(gpioPort, pinNumber, &pinInitialState, &portBase, &pinMacro);
  initData(timerNumber, timerLoad, pinInitialState, portBase, pinMacro);
  initTimer(timerLoad, timerNumber);

	RovePwmRead_Handle handle;

	handle.initialized = true;
	handle.mappedPin = mappedPin;

	return(handle);
}

//wrapper for internal stopPwmRead function, added layer to allow 
//the user to pass an energia pin map value 
void stopPwmRead(RovePwmRead_Handle handle)
{	
  if(handle.initialized == false)
  {
    debugFault("stopPwmRead: pwmRead handle not initialized (did you call the init function?)");
  }

  uint8_t mappedPin = handle.mappedPin;
  uint8_t pinNumber = pinMapToPinNum[mappedPin];
	char portLetter = pinMapToPort[mappedPin];
	uint32_t timerBase = 0;
  uint8_t timerNum;
  uint32_t portBase;
  int16_t portRefNum;
  uint8_t pinMacro;
  timerData * dataUsed;
  
  timerData * datas [NumberOfTimersUsed] = {&timer0Data, &timer1Data, &timer2Data, &timer3Data, &timer4Data, &timer5Data};

  portRefNum = getPortRefNum(portLetter);
  portBase = pinPortBaseTable[portRefNum];
  pinMacro = pinMacroTable[pinNumber];

  for(int i = 0; i < NumberOfTimersUsed; i++)
  {
    uint32_t dataPortBase = datas[i] -> portBase;
    uint8_t dataPinMacro = datas[i] -> pinMacro;
    
    if(portBase == dataPortBase && pinMacro == dataPinMacro)
    {
      timerBase = timerBaseTable[i];
      dataUsed = datas[i];
      timerNum = i + 1;
    }
  }
  
  TimerDisable(timerBase, TIMER_BOTH);
  TimerIntClear(timerBase, TIMER_CAPA_EVENT | TIMER_TIMB_TIMEOUT);
  TimerIntDisable(timerBase, TIMER_CAPA_EVENT | TIMER_TIMB_TIMEOUT);
  
  //reset data structure for that timer
  initData(timerNum, dataUsed->timerLoad, 0, 0, 0);
}

