MissouriMRDT/BMS_Software/libraries/RoveBoard/tm4c1294ncpdt_API/RovePwmRead/RovePwmRead_TivaTM4C1294NCPDT.cpp
//wrapper for internal getDuty function, added layer to allow 
//the user to pass an energia pin map value 
uint8_t getDuty(RovePwmRead_Handle handle)
{	
  if(handle.initialized == false)
  {
    debugFault("getDuty: pwmRead handle not initialized (did you call the init function?)");
  }

  uint8_t mappedPin = handle.mappedPin;
	char portLetter = pinMapToPort[mappedPin];
	uint8_t pinNumber = pinMapToPinNum[mappedPin];
  uint32_t portBase;
  int16_t portRefNum;
  uint8_t pinMacro;
  uint8_t duty;
  timerData * datas [NumberOfTimersUsed] = {&timer0Data, &timer1Data, &timer2Data, &timer3Data, &timer4Data, &timer5Data};
  
  //get the port base for the passed letter
  portRefNum = getPortRefNum(portLetter);
  portBase = pinPortBaseTable[portRefNum];
  pinMacro = pinMacroTable[pinNumber];
  
  for(int i = 0; i < NumberOfTimersUsed; i++)
  {
    uint32_t dataPortBase = datas[i] -> portBase;
    uint8_t dataPinMacro = datas[i] -> pinMacro;
    
    if(portBase == dataPortBase && pinMacro == dataPinMacro)
    {
      duty = datas[i] -> duty;
    }
  }

  return(duty);
}

//wrapper for internal getTotalPeriod_us function, added layer to allow 
//the user to pass an energia pin map value 
uint32_t getTotalPeriod(RovePwmRead_Handle handle, RovePwmRead_Scale scale)
{
  if(handle.initialized == false)
  {
    debugFault("getTotalPeriod_us: pwmRead handle not initialized (did you call the init function?)");
  }

  uint8_t mappedPin = handle.mappedPin;
	char portLetter = pinMapToPort[mappedPin];
	uint8_t pinNumber = pinMapToPinNum[mappedPin];
  uint32_t totalPeriod;
  uint32_t portBase;
  int16_t portRefNum;
  uint8_t pinMacro;
  uint32_t tOn;
  uint32_t tOff;
  timerData * datas [NumberOfTimersUsed] = {&timer0Data, &timer1Data, &timer2Data, &timer3Data, &timer4Data, &timer5Data};


  //get the port base for the passed letter
  portRefNum = getPortRefNum(portLetter);
  portBase = pinPortBaseTable[portRefNum];
  pinMacro = pinMacroTable[pinNumber];
  
  for(int i = 0; i < NumberOfTimersUsed; i++)
  {
    uint32_t dataPortBase = datas[i] -> portBase;
    uint8_t dataPinMacro = datas[i] -> pinMacro;
    
    if(portBase == dataPortBase && pinMacro == dataPinMacro)
    {
      tOff = datas[i] -> tOff;
      tOn = datas[i] -> tOn;
    }
  }

  //tOff + tOn = period in timer clock ticks (assumed to be using system clock). Divided by SysClockFreq = period in seconds. Times 1,000,000 = period in microseconds
  float period_ticks = tOn + tOff;
  float totalPeriods_s = period_ticks /SysClockFreq;
  if(scale == PWM_NANO)
  {
    totalPeriod = (uint32_t) (1000000000.0 * totalPeriods_s);
  }
  else if(scale == PWM_MICRO)
  {
    totalPeriod = (uint32_t) (1000000.0 * totalPeriods_s);
  }
  return(totalPeriod);
}

//wrapper for internal getOnPeriod_s function, added layer to allow 
//the user to pass an energia pin map value 
uint32_t getOnPeriod(RovePwmRead_Handle handle, RovePwmRead_Scale scale)
{	
  if(handle.initialized == false)
  {
    debugFault("getOnPeriod_us: pwmRead handle not initialized (did you call the init function?)");
  }

  uint8_t mappedPin = handle.mappedPin;
	char portLetter = pinMapToPort[mappedPin];
	uint8_t pinNumber = pinMapToPinNum[mappedPin];
  uint32_t portBase;
  int16_t portRefNum;
  uint8_t pinMacro;
  double tOn;
  uint32_t onPeriod;
  timerData * datas [NumberOfTimersUsed] = {&timer0Data, &timer1Data, &timer2Data, &timer3Data, &timer4Data, &timer5Data};
  
  //get the port base for the passed letter
  portRefNum = getPortRefNum(portLetter);
  portBase = pinPortBaseTable[portRefNum];
  pinMacro = pinMacroTable[pinNumber];
  
  for(int i = 0; i < NumberOfTimersUsed; i++)
  {
    uint32_t dataPortBase = datas[i] -> portBase;
    uint8_t dataPinMacro = datas[i] -> pinMacro;
    
    if(portBase == dataPortBase && pinMacro == dataPinMacro)
    {
      tOn = datas[i] -> tOn;
      break;
    }
  }

  double onPeriod_s = tOn / SysClockFreq;

  //tOn = on period in timer clock ticks (assumed to be using system clock). Divided by SysClockFreq = period in seconds. Times 1,000,000 = period in microseconds
  if(scale == PWM_MICRO)
  {
    onPeriod= (uint32_t)(onPeriod_s * 1000000.0);
  }
  else if(scale == PWM_NANO)
  {
    onPeriod= (uint32_t)(onPeriod_s * 1000000000.0);
  }
  return(onPeriod);
}

//returns the reference number choresponding to the port letter passed.
//Use the reference number to sub in for ports when accessing tables that 
//take in a gpio port reference.
//Returns -1 if passed letter doesn't correspond to any port
static int getPortRefNum(char portLetter)
{
  int portRefNum;
  
  if(portLetter == 'A' || portLetter == 'a')
  {
    portRefNum = Internal_PortARef;
  }
  else if (portLetter == 'B' || portLetter == 'b')
  {
    portRefNum = Internal_PortBRef;
  }
  else if(portLetter == 'D' || portLetter == 'd')
  {
    portRefNum = Internal_PortDRef;
  }
  else if(portLetter == 'L' || portLetter == 'l')
  {
    portRefNum = Internal_PortLRef;
  }
  else if(portLetter == 'M' || portLetter == 'm')
  {
    portRefNum = Internal_PortMRef;
  }
  else
  {
    portRefNum = -1;
  }

  return(portRefNum);
}

//pass in a gpioport letter and number such as 'a' and '2', and it returns
//which timer is associated from it. Returns 0 if no timer uses that pin port and pin number
static uint8_t getTimerNumber(char portLetter, uint8_t pinNumber)
{
  int16_t portRefNum;
  uint8_t timerNumber;

  portRefNum = getPortRefNum(portLetter);
  if(portRefNum == -1)
  {
    return(0);
  }

  timerNumber = pinToTimerNumberTable[portRefNum][pinNumber];

  return(timerNumber);
}

//initializes data for the pwm line associated with the passed timer
static void initData(uint8_t timerNum, uint32_t timerLoad, uint8_t pinInitState, uint32_t port_base, uint8_t pin_macro)
{
  timerData *data[NumberOfTimersUsed] = {&timer0Data, &timer1Data, &timer2Data, &timer3Data, &timer4Data, &timer5Data};
  Pinstate pinState;

  if(pinInitState == 0)
  {
    pinState = pulseL;
  }
  else
  {
    pinState = pulseH;
  }

  if(timerNum <= NumberOfTimersUsed)
  {
    data[timerNum] -> tOn = 0;
    data[timerNum] -> tOff = 0;
    data[timerNum] -> tRise = 0;
    data[timerNum] -> tFall = 0;
    data[timerNum] -> duty = 0;
    data[timerNum] -> portBase = port_base;
    data[timerNum] -> pinMacro = pin_macro;
    data[timerNum] -> timerLoad = timerLoad;
    data[timerNum] -> periodIncalculable = false;
    data[timerNum] -> edgeRecieved = false;
    data[timerNum] -> pinState = pinState;
  }
}

//initializes timer, and turns on its interrupts
static bool initTimer(uint32_t timerLoad, uint8_t timerNum)
{
  uint32_t timerBase;
  uint32_t timerPeriph;
  uint32_t enableTimerIntAVal;
  uint32_t enableTimerIntBVal;
  void (*captureHandler)(void);
  void (*timeHandler)(void);
  
  if(timerNum == 0)
  {
    timerBase = TIMER0_BASE;
    timerPeriph = SYSCTL_PERIPH_TIMER0;
    enableTimerIntAVal = INT_TIMER0A;
    enableTimerIntBVal = INT_TIMER0B;
    captureHandler = &edgeCapture0Handler;
    timeHandler = &timeout0Handler;
  }
  else if(timerNum == 1)
  {
    timerBase = TIMER1_BASE;
    timerPeriph = SYSCTL_PERIPH_TIMER1;
    enableTimerIntAVal = INT_TIMER1A;
    enableTimerIntBVal = INT_TIMER1B;
    captureHandler = &edgeCapture1Handler;
    timeHandler = &timeout1Handler;
  }
  else if(timerNum == 2)
  {
    timerBase = TIMER2_BASE;
    timerPeriph = SYSCTL_PERIPH_TIMER2;
    enableTimerIntAVal = INT_TIMER2A;
    enableTimerIntBVal = INT_TIMER2B;
    captureHandler = &edgeCapture2Handler;
    timeHandler = &timeout2Handler;
  }
  else if(timerNum == 3)
  {
    timerBase = TIMER3_BASE;
    timerPeriph = SYSCTL_PERIPH_TIMER3;
    enableTimerIntAVal = INT_TIMER3A;
    enableTimerIntBVal = INT_TIMER3B;
    captureHandler = &edgeCapture3Handler;
    timeHandler = &timeout3Handler;
  }
  else if(timerNum == 4)
  {
    timerBase = TIMER4_BASE;
    timerPeriph = SYSCTL_PERIPH_TIMER4;
    enableTimerIntAVal = INT_TIMER4A;
    enableTimerIntBVal = INT_TIMER4B;
    captureHandler = &edgeCapture4Handler;
    timeHandler = &timeout4Handler;
  }
  else if(timerNum == 5)
  {
    timerBase = TIMER5_BASE;
    timerPeriph = SYSCTL_PERIPH_TIMER5;
    enableTimerIntAVal = INT_TIMER5A;
    enableTimerIntBVal = INT_TIMER5B;
    captureHandler = &edgeCapture5Handler;
    timeHandler = &timeout5Handler;
  }
  else
  {
    return(false);
  }
  
  //enable timer hardware
  SysCtlPeripheralEnable(timerPeriph);

  //set clock to main system clock
  TimerClockSourceSet(timerBase, TIMER_CLOCK_PIOSC);

