MissouriMRDT/BMS_Software/libraries/RoveBoard/tm4c1294ncpdt_API/RovePwmRead/RovePwmRead_TivaTM4C1294NCPDT.cpp
  //configure timer A for count-up capture edge time, and timer B as count up periodic
  TimerConfigure(timerBase, (TIMER_CFG_SPLIT_PAIR | TIMER_CFG_A_CAP_TIME_UP | TIMER_CFG_B_PERIODIC_UP));

  //set timer a to count the time for both edges
  TimerControlEvent(timerBase, TIMER_A, TIMER_EVENT_BOTH_EDGES);

  //set timer loads. Both loads in sync

  TimerLoadSet(timerBase, TIMER_A, (timerLoad & 0xFFFF)); //load register only holds first 16 bits
  TimerPrescaleSet(timerBase, TIMER_A, (uint8_t)(timerLoad >> 16)); //prescale takes the last 8 bits
  TimerLoadSet(timerBase, TIMER_B, (timerLoad & 0xFFFF)); //load register only holds first 16 bits
  TimerPrescaleSet(timerBase, TIMER_B, (uint8_t)(timerLoad >> 16)); //prescale takes the last 8 bits

  //set up interrupts
  TimerIntClear(timerBase, TIMER_CAPA_EVENT | TIMER_TIMB_TIMEOUT);
  TimerIntEnable(timerBase, TIMER_CAPA_EVENT | TIMER_TIMB_TIMEOUT);

  IntPrioritySet(enableTimerIntAVal, (PwmReadEdgeCaptureInterruptPriority_Default << 5)); //priority is last 3 bits of 8 bit register
  IntPrioritySet(enableTimerIntBVal, (PwmReadTimeoutInterruptPriority_Default << 5));
  IntEnable(enableTimerIntAVal| enableTimerIntBVal);

  //register interrupt functions 
  TimerIntRegister(timerBase, TIMER_A, (captureHandler));
  TimerIntRegister(timerBase, TIMER_B, (timeHandler));
  
  //enable master system interrupt
  IntMasterEnable();

  //enable both timers -- they both begin after this
  TimerEnable(timerBase, TIMER_BOTH);

  return(true);
}

//initializes the gpio pin used for reading the pwm pulse, 
//and configures it for usage by the appropriate timer
static bool initGPIO(uint8_t portLetter, uint8_t pinNum, uint8_t * pinInitState, uint32_t * port_base, uint8_t * pin_macro)
{
  int portRefNum;
  uint32_t portPeriph;
  uint32_t portBase;
  uint8_t pinMacro;  
  if(pinNum >= 8) //pins have to be 0-7
  {
    return(false);
  }

  //get hardware constants associated with this port letter
  portRefNum = getPortRefNum(portLetter);
  if(portRefNum == -1)
  {
    return(false);
  }

  portBase = pinPortBaseTable[portRefNum];
  portPeriph = pinPortPeriphTable[portRefNum];

  //acquire the actual macro for the pin number -- it's not 0,1,2,3, etc, because that'd be too easy
  pinMacro = pinMacroTable[pinNum];

  //initialize port
  SysCtlPeripheralEnable(portPeriph);

  //get the pin initial reading
  GPIOPinTypeGPIOInput(portBase, pinMacro);
  if(((GPIOPinRead(portBase, pinMacro)) & pinMacro) == 0)
  {
    *pinInitState = 0; //PinRead returns pinMacro if pin is high, 0 if low, so return & pinMacro == 0 if low
  }
  else
  {
    *pinInitState = 1;
  }

  //enable pin for timer usage
  GPIOPinTypeTimer(portBase, pinMacro);

  //configure pin for timer usage (yes it's a different function)
  if(timerPinConfigTable[portRefNum] [pinNum] == 0)
  {
    return(false); //user input a combination that isn't used
  }
  GPIOPinConfigure(timerPinConfigTable[portRefNum] [pinNum]);

  *pin_macro = pinMacro;
  *port_base = portBase;
  return(true);
}

//check to make sure that the timer selected is using the correct pins
//TO SEE MAPPED PINS GO TO http://www.ti.com/lit/ds/symlink/tm4c1294ncpdt.pdf AND LOOK ON THE BOTTOM OF PAGE 957
static bool moduleUsesCorrectPins(uint8_t timerModule, uint8_t mappedPin)
{
  switch(timerModule)
  {
    case ReadModule0:
      if(mappedPin == PD_0 || mappedPin == PA_0 || mappedPin == PL_4)
      {
        return true;
      }
      break;
    case ReadModule1:
      if(mappedPin == PA_2 || mappedPin == PD_2 || mappedPin == PL_6)
      {
        return true;
      }
      break;

    case ReadModule2:
      if(mappedPin == PA_4 || mappedPin == PM_0)
      {
        return true;
      }
      break;

    case ReadModule3:
      if(mappedPin == PA_6 || mappedPin == PD_4 || mappedPin == PM_2)
      {
        return true;
      }
      break;

    case ReadModule4:
      if(mappedPin == PB_0 || mappedPin == PM_4)
      {
        return true;
      }
      break;

    case ReadModule5:
      if(mappedPin == PB_2 || mappedPin == PM_6)
      {
        return true;
      }
      break;
  }

  return false;
}

void setPwmReadInterruptPriority(RovePwmRead_Handle handle, uint8_t edgeCapturePriority, uint8_t timeoutCapturePriority)
{
  if(handle.initialized == false)
  {
    debugFault("setPwmReadInterruptPriority: pwmRead handle not initialized (did you call the init function?)");
  }

  uint8_t mappedPin;
  uint8_t portRefNum;
  char gpioPort;
  uint8_t pinNumber;
  uint8_t timerNum;
  uint8_t enableTimerIntAVal;
  uint8_t enableTimerIntBVal;

  mappedPin = handle.mappedPin;

  gpioPort = pinMapToPort[mappedPin];
  if(gpioPort == 0) //0 is error value for this table
  {
    return;
  }

  pinNumber = pinMapToPinNum[mappedPin];
  if(pinNumber == 255)
  {
    return; //255 is error value for this table
  }

  portRefNum = getPortRefNum(gpioPort);
  timerNum = pinToTimerNumberTable[portRefNum][pinNumber];

  if(timerNum == 0)
  {
    enableTimerIntAVal = INT_TIMER0A;
    enableTimerIntBVal = INT_TIMER0B;
  }
  else if(timerNum == 1)
  {
    enableTimerIntAVal = INT_TIMER1A;
    enableTimerIntBVal = INT_TIMER1B;
  }
  else if(timerNum == 2)
  {
    enableTimerIntAVal = INT_TIMER2A;
    enableTimerIntBVal = INT_TIMER2B;
  }
  else if(timerNum == 3)
  {
    enableTimerIntAVal = INT_TIMER3A;
    enableTimerIntBVal = INT_TIMER3B;
  }
  else if(timerNum == 4)
  {
    enableTimerIntAVal = INT_TIMER4A;
    enableTimerIntBVal = INT_TIMER4B;
  }
  else if(timerNum == 5)
  {
    enableTimerIntAVal = INT_TIMER5A;
    enableTimerIntBVal = INT_TIMER5B;
  }
  else
  {
    return ;
  }

  IntDisable(enableTimerIntAVal| enableTimerIntBVal);
  IntPrioritySet(enableTimerIntAVal, (edgeCapturePriority << 5)); //priority is last 3 bits of 8 bit register
  IntPrioritySet(enableTimerIntBVal, (timeoutCapturePriority << 5));
  IntEnable(enableTimerIntAVal| enableTimerIntBVal);
}

void setDisconnectCheckTimeout(RovePwmRead_Handle handle, uint32_t timeout_us)
{
  if(handle.initialized == false)
  {
    debugFault("setDisconnectCheckTimeout: pwmRead handle not initialized (did you call the init function?)");
  }

  uint8_t mappedPin;
  uint8_t portRefNum;
  char gpioPort;
  uint8_t pinNumber;
  uint8_t timerNum;
  uint32_t timerBase;
  uint8_t enableTimerIntAVal;
  uint8_t enableTimerIntBVal;
  uint32_t timerLoad;
  mappedPin = handle.mappedPin;

  gpioPort = pinMapToPort[mappedPin];
  if(gpioPort == 0) //0 is error value for this table
  {
    return;
  }

  pinNumber = pinMapToPinNum[mappedPin];
  if(pinNumber == 255)
  {
    return; //255 is error value for this table
  }

  portRefNum = getPortRefNum(gpioPort);
  timerNum = pinToTimerNumberTable[portRefNum][pinNumber];

  switch(timerNum)
  {
    case 0:
      timerBase = TIMER0_BASE;
      break;

    case 1:
      timerBase = TIMER1_BASE;
      break;

    case 2:
      timerBase = TIMER2_BASE;
      break;

    case 3:
      timerBase = TIMER3_BASE;
      break;

    case 4:
      timerBase = TIMER4_BASE;
      break;

    case 5:
      timerBase = TIMER5_BASE;
      break;
  }

  timerLoad = ((float)(timeout_us) * (float)(SysClockFreq)) / 1000000.0;
  TimerLoadSet(timerBase, TIMER_B, (timerLoad & 0xFFFF)); //load register only holds first 16 bits
  TimerPrescaleSet(timerBase, TIMER_B, (uint8_t)(timerLoad >> 16)); //prescale takes the last 8 bits

  return;
}
